# Контрольная работа №1 
***Условие задачи:***

**Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых <= 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.**


***Решение:***

*Задаём массив*

```C#
string[] array ={"Hello", "Hi", "2", "world", ";-)", "-2", "1234", "*"};
```

*Создаем метод подсчета строк, число символов в которых <=3*

```C#
int CountingStrings(string[] arr)
```
*Пробегаем по массиву и если число символов в строке <=3 то увеличиваем счетчик*
```C#
    int count = 0;
    for (int i = 0; i < arr.Length; i++)  
    {
        if (arr[i].Length <= 3)
        {
            count++;
        }
    }
    return count;
```
*Задаем новый массив, размерностью нашего счетчика count*
```C#
string[] newArray = new string[CountingStrings(array)];
```
*Снова пробегаем по первому массиву и если число символов в строке <=3 то эту строку записываем в новый массив*
```C#
int j = 0;
for (int i = 0; i < array.Length; i++)
{
    if (array[i].Length <= 3)
    {
        newArray[j] = array[i];
        j++;
    }
}
```
*Выводим новый массив на экран*
```C#
Console.WriteLine(string.Join(", ", newArray));
```
